// Напишите программу, которая на вход принимает число и выдаёт его квадрат
// (число умноженное само на себя)
// Например:
// 4 -> 16
// -3 -> 9
// -7 -> 49

int value = 10;
int result = value * value;
Console.WriteLine(result);